# link design
current_design mydesign
link

# check design
check_design ./rpt/mydesign.chk_design.rpt

# write ddc
write_file -f ddc -hier -output out/unmapped/mydesign.ddc

# wrtie verilog netlist
write -f verilog -hier -output ./out/unmapped/mydesign.v
