#compile_ultra
#create_auto_path_groups -mode mapped
#compile_ultra -incremental
compile_ultra -no_autoungroup
#current_design complex_cal
#set_optimize_registers true -design complex_mul
#current_design complex_cal
#compile_ultra -retime -timing
#compile_ultra
#group_path -name INPUTS -from [all_inputs]
#group_path -name OUTPUTS -to [all_outputs]
#group_path -name COMBO -from [all_inputs] -to [all_outputs]
#group_path -name CLK -critical 0.2 -weight 5
#compile_ultra -incremental
